lierda-iot/WizBlock/CODE/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_MODEL_IN_SPIFFS=y
CONFIG_SR_MN_NONE=y

CONFIG_LAIWFS300_BRINGUP_TEST_LOG_TASK=y
CONFIG_LAIWFS300_BRINGUP_TEST_LOG_PERIOD_MS=2000
CONFIG_LAIWFS300_ENABLE_MOTOR_SMOKE_TEST=y
CONFIG_LAIWFS300_MOTOR_SMOKE_TEST_DRY_RUN=n
CONFIG_LAIWFS300_ENABLE_DISPLAY_COLOR_TEST=y
CONFIG_LAIWFS300_ENABLE_CAMERA_PREVIEW_TEST=n

CONFIG_LAIWFS300_ENABLE_TOUCH_TEST=y
CONFIG_LAIWFS300_ENABLE_RTC_TEST=n
CONFIG_LAIWFS300_ENABLE_IMU_TEST=y
CONFIG_LAIWFS300_ENABLE_IOEX_INPUT_TEST=y
CONFIG_LAIWFS300_ENABLE_AUDIO_LOOPBACK_TEST=y

CONFIG_LAIWFS300_ENABLE_LTE_NET_TEST=y
CONFIG_LAIWFS300_LTE_NET_TEST_WIFI_SSID="lierda-guest"
CONFIG_LAIWFS300_LTE_NET_TEST_WIFI_PASSWORD="lsd920249"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
